results-homelab-colocated/output_homelab_colocate_3vm_gemfire_insidegemfire-10000_1t_load.txt
/var/vcap/packages/jdk/bin/java  -classpath /root/workspace/YCSB-geode-custom/conf:/root/workspace/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -load -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -load -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] recordcount:10000
[INFO] threadcount:1
[INFO] operationcount:10000
[INFO] readproportion:0.5
[INFO] updateproportion:0.5
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-04-20 14:50:58:061 0 sec: 0 operations; est completion in 0 second 
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
[DEBUG] GeodeClient.java addPoolLocator:4c5fec0a-a29e-461a-a8a4-c9c6af900194.locator-server.network.service-instance-1d8cf652-27f5-4220-a04f-1cadb69b08fe.bosh:55221
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-20 14:51:04:660 6 sec: 10000 operations; 1501.5 current ops/sec; [CLEANUP: Count=1, Max=4, Min=4, Avg=4, 90=4, 99=4, 99.9=4, 99.99=4] [INSERT: Count=10000, Max=694783, Min=173, Avg=525.21, 90=420, 99=5479, 99.9=18735, 99.99=62079] 
[OVERALL], RunTime(ms), 6668
[OVERALL], Throughput(ops/sec), 1499.7000599880023
[TOTAL_GCS_G1_Young_Generation], Count, 11
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 53
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7948410317936413
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 53
[TOTAL_GC_TIME_%], Time(%), 0.7948410317936413
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4.0
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 4
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 525.2112
[INSERT], MinLatency(us), 173
[INSERT], MaxLatency(us), 694783
[INSERT], 95thPercentileLatency(us), 683
[INSERT], 99thPercentileLatency(us), 5479
[INSERT], Return=OK, 10000